# Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.
print("Задание 4.")
number = input("Введите длинное число чтобы узнать самую большую цифру ")
n = len(number)
max = int(number[0])
i = 0
while i < n:
    if int(number[i]) > max:
        max = int(number[i])
    i += 1
print(f"Самая большая цифра: {max}")
