# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.
print("Задание 5.")
proceed = int(input("Укажите выручку "))
cost = int(input("Укажите издержки  "))
profit = proceed - cost
if proceed > cost:
    print(f"Фирма работает с прибылью в {profit} у.е.")
    profitability = (proceed - cost)/proceed
    numbers = int(input("Укажите численность сотрудников "))
    print(f"Прибыль фирмы в расчете на 1 сотрудника = {int(profit/numbers)} у.е.")
elif proceed < cost:
    print("Фирма работает в убыток.")
