# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и  выводить одно натуральное число — номер дня.
print("Задание 6.")
a = int(input("Результат в первый день (км): "))
b = int(input("Жлаемый результат (км): "))
day = 1
while a < b:
    a += a/10
    day += 1
    print(f"{day}-й день: {round(a, 2)} км, цель: {b} км ")
print(f"На {day}-й день пользователь достиг результата - не менее {b} км.")
